tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "d12frosted/emacs-plus"

brew "coreutils"
brew "asdf"
brew "cocoapods"
brew "consul"
brew "direnv"
brew "fish"
brew "fzf"
brew "git"
brew "gnupg"
brew "gtkmm"
brew "hub"
brew "ical-buddy"
brew "jq"
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "ios-deploy"
brew "macvim"
brew "neovim"
brew "opencv"
brew "opencv@2"
brew "pkg-config"
brew "ripgrep"
brew "shfmt"
brew "terraform"
brew "tmate"
brew "tmux"
brew "wget"
brew "zsh"

brew "d12frosted/emacs-plus/emacs-plus"
brew "thoughtbot/formulae/rcm"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "aws-vault"
cask "devonthink-pro-office"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox-nightly"
cask "font-anonymouspro-nerd-font"
cask "font-anonymouspro-nerd-font-mono"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "keyboard-maestro"
cask "kitty"
cask "little-snitch"
cask "pgadmin4"
cask "postgres"
cask "rocket"
cask "secure-pipes"
cask "skype"
cask "slack"
cask "soulver"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
